lvx/base/Catalogs/бит_ШаблоныВводаНаОсновании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныВводаНаОсновании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаЗаполненияПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитПриемника</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыЗаполненияРеквизитовПоШаблону</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИсточника</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_ШаблоныВводаНаОсновании/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектПриемникПриИзменении(Элемент)
	
	Если Объект.ОбъектПриемник.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ДоступныеОбъектыОснования());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",              Отбор);
	ПараметрыФормы.Вставить("ОтображениеТаблицы", ПредопределенноеЗначение("ОтображениеТаблицы.Список"));
	ПараметрыФормы.Вставить("ТекущаяСтрока",      Объект.ОбъектОснование);
	ОткрытьФорму("Справочник.бит_ОбъектыСистемы.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ДоступныеОбъектыПрименики());
	Отбор.Вставить("ПометкаУдаления", Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",              Отбор);
	ПараметрыФормы.Вставить("ОтображениеТаблицы", ПредопределенноеЗначение("ОтображениеТаблицы.Список"));
	ПараметрыФормы.Вставить("ТекущаяСтрока",      Объект.ОбъектПриемник);
	ОткрытьФорму("Справочник.бит_ОбъектыСистемы.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравилаЗаполненияПолей

&НаКлиенте
Процедура ПравилаЗаполненияПолейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Объект.ОбъектОснование.Пустая()
		ИЛИ Объект.ОбъектПриемник.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Для добавления правил необходимо указать объект основание и приемник.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыПравилЗаполнения = ПараметрыПравилЗаполнения();
	ОткрытьФормуИзмененияПравила(ПараметрыПравилЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаЗаполненияПолейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ОбработатьИзмененияПравилаДляПоля(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаЗаполненияПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПравилаЗаполненияПолей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтроки) Тогда
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ПараметрыПравилЗаполнения = ПараметрыПравилЗаполнения();
	ЗаполнитьЗначенияСвойств(ПараметрыПравилЗаполнения, ТекущиеДанные);
	ОткрытьФормуИзмененияПравила(ПараметрыПравилЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаименование()
	
	Если Объект.ОбъектПриемник.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеПриемника = Справочники.бит_ОбъектыСистемы.ОбъектМетаданныхПоОбъектуСистемы(Объект.ОбъектПриемник);
	Объект.Наименование = ОбщегоНазначения.ПредставлениеОбъекта(МетаданныеПриемника);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПравилЗаполнения()
	
	ПараметрыПравилЗаполнения = Справочники.бит_ШаблоныВводаНаОсновании.НовыеПараметрыПравилЗаполнения();
	ЗаполнитьЗначенияСвойств(ПараметрыПравилЗаполнения, Объект, "ОбъектОснование, ОбъектПриемник");
	Возврат ПараметрыПравилЗаполнения;
	
КонецФункции

&НаСервере
Процедура ОбработатьИзмененияПравилаДляПоля(Знач ПараметрыПравилЗаполнения)
	
	СтрокаРеквизита     = Неопределено;
	ИдентификаторСтроки = ПараметрыПравилЗаполнения.ИдентификаторСтроки;
	Если ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
		СтрокиРеквизита = Объект.ПравилаЗаполненияПолей.НайтиСтроки(Отбор);
		Если СтрокиРеквизита.Количество() > 0 Тогда
			СтрокаРеквизита = СтрокиРеквизита[0];
		КонецЕсли;
	КонецЕсли;
	Если СтрокаРеквизита = Неопределено Тогда
		СтрокаРеквизита = Объект.ПравилаЗаполненияПолей.Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаРеквизита, ПараметрыПравилЗаполнения);	
	
	Объект.ПравилаЗаполненияПолей.Сортировать("РеквизитПриемника");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИзмененияПравила(ПараметрыПравилЗаполнения)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",                   Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",            Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("ПараметрыПравилЗаполнения", ПараметрыПравилЗаполнения);
	ОткрытьФорму("Справочник.бит_ШаблоныВводаНаОсновании.Форма.ПравилоЗаполненияПоля",
					ПараметрыФормы,
					Элементы.ПравилаЗаполненияПолей,
					,
					,
					,
					,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеОбъектыОснования()
	
	ДоступныеМетаданные = Новый Массив;
	
	// АПК:278-выкл Вызов типового функционала.
	ИнтеграцияПодсистемБСП.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(ДоступныеМетаданные);
	// АПК:278-вкл
	СозданиеНаОснованииПереопределяемый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(ДоступныеМетаданные);
	
	Возврат Справочники.бит_ОбъектыСистемы.ОбъектыСистемыПоОбъектамМетаданных(ДоступныеМетаданные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеОбъектыПрименики()
	
	ДоступныеМетаданные = Новый Массив;
	Для каждого ТипОснования Из Метаданные.ПодпискиНаСобытия.бит_ОбработкаЗаполненияПоШаблону.Источник.Типы() Цикл
		МетаданныеОснования = Метаданные.НайтиПоТипу(ТипОснования);
		Если СтрНачинаетсяС(МетаданныеОснования.Имя, "Удалить") Тогда
			Продолжить;
		КонецЕсли;
		ДоступныеМетаданные.Добавить(МетаданныеОснования);
	КонецЦикла;
	
	Возврат Справочники.бит_ОбъектыСистемы.ОбъектыСистемыПоОбъектамМетаданных(ДоступныеМетаданные);
	
КонецФункции

#КонецОбласти
